app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "image_url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["image_url", "test"], ["description", "falwejflawjef"], ["created_at", "2018-03-26 19:56:09.911116"], ["updated_at", "2018-03-26 19:56:09.911116"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)
    if @ingredient.save